app/controllers/barbecues_controller.rb

  def index
    @barbecues = Barbecue.order(:date)
---
SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC

  def json
    barbecue = Barbecue.find_by(id: params[:id])
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 7]]

  def join
    bbq = Barbecue.find_by(id: params[:id])
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 4]]